class Script(object):
    START_TXT = """𝚑𝚎𝚕𝚘 {},
𝚖𝚢 𝚗𝚊𝚖𝚎 𝚒𝚜 <a href=https://t.me/{}>{}</a>, 𝚒 𝚌𝚊𝚗 𝚙𝚛𝚘𝚟𝚒𝚍𝚎 𝚋𝚘𝚘𝚔𝚜, 𝚓𝚞𝚜𝚝 𝚊𝚍𝚍 𝚖𝚎 𝚝𝚘 𝚢𝚘𝚞𝚛 𝚐𝚛𝚘𝚞𝚙 𝚊𝚗𝚍 𝚎𝚗𝚓𝚘𝚢 😍"""
    HELP_TXT = """𝚑𝚎𝚢 {}
𝚑𝚎𝚛𝚎 𝚒𝚜 𝚝𝚑𝚎 𝚑𝚎𝚕𝚙 𝚏𝚘𝚛 𝚖𝚢 𝚌𝚘𝚖𝚖𝚊𝚗𝚍𝚜."""
    ABOUT_TXT = """✯ 𝚖𝚢 𝚗𝚊𝚖𝚎: {}
✯ 𝚌𝚛𝚎𝚊𝚝𝚘𝚛: <a href=https://t.me/loki_not>ɴᴏᴏʙs ᴏғ ᴛᴇʟᴇɢʀᴀᴍ ◉『 ɴᴏᴛ 』</a>
✯ 𝚕𝚒𝚋𝚛𝚊𝚛𝚢: 𝚙𝚢𝚛𝚘𝚐𝚛𝚊𝚖
✯ 𝚕𝚊𝚗𝚐𝚞𝚊𝚐𝚎: 𝚙𝚢𝚝𝚑𝚘𝚗 𝟹
✯ 𝚍𝚊𝚝𝚊 𝚋𝚊𝚜𝚎: 𝚖𝚘𝚗𝚐𝚘 𝚍𝚋
✯ 𝚋𝚘𝚝 𝚜𝚎𝚛𝚟𝚎𝚛: 𝚟𝚙𝚜
✯ 𝚋𝚞𝚒𝚕𝚍 𝚜𝚝𝚊𝚝𝚞𝚜: v1.0.1 [ 𝚋𝚎𝚝𝚊 ]"""
    SOURCE_TXT = """<b>𝚗𝚘𝚝𝚎:</b>
- 𝚃𝚑𝚒𝚜 𝚒𝚜 𝚊𝚗 𝚘𝚙𝚎𝚗 𝚜𝚘𝚞𝚛𝚌𝚎 𝚙𝚛𝚘𝚓𝚎𝚌𝚝. 
- 𝚂𝚘𝚞𝚛𝚌𝚎 - https://github.com/mastermindmayankofficial/mastermind/

<b>𝚍𝚎𝚟𝚜:</b>
- <a href=https://github.com/MrMKN>𝚌𝚕𝚒𝚌𝚔</a>"""
    MANUELFILTER_TXT = """𝚑𝚎𝚕𝚙: <b>𝙵𝚒𝚕𝚝𝚎𝚛𝚜</b>

- 𝙵𝚒𝚕𝚝𝚎𝚛 𝚒𝚜 𝚝𝚑𝚎 𝚏𝚎𝚊𝚝𝚞𝚛𝚎 𝚠𝚑𝚎𝚛𝚎 𝚞𝚜𝚎𝚛𝚜 𝚌𝚊𝚗 𝚜𝚎𝚝 𝚊𝚞𝚝𝚘𝚖𝚊𝚝𝚎𝚍 𝚛𝚎𝚙𝚕𝚒𝚎𝚜 𝚏𝚘𝚛 𝚊 𝚙𝚊𝚛𝚝𝚒𝚌𝚞𝚕𝚊𝚛 𝚔𝚎𝚢𝚠𝚘𝚛𝚍 𝚊𝚗𝚍 𝙴𝚟𝚊𝙼𝚊𝚛𝚒𝚊 𝚠𝚒𝚕𝚕 𝚛𝚎𝚜𝚙𝚘𝚗𝚍 𝚠𝚑𝚎𝚗𝚎𝚟𝚎𝚛 𝚊 𝚔𝚎𝚢𝚠𝚘𝚛𝚍 𝚒𝚜 𝚏𝚘𝚞𝚗𝚍 𝚝𝚑𝚎 𝚖𝚎𝚜𝚜𝚊𝚐𝚎

<b>𝙽𝙾𝚃𝙴:</b>
1. 𝚎𝚟𝚊 𝚖𝚊𝚛𝚒𝚊 𝚜𝚑𝚘𝚞𝚕𝚍 𝚑𝚊𝚟𝚎 𝚊𝚍𝚖𝚒𝚗 𝚙𝚛𝚒𝚟𝚒𝚕𝚕𝚊𝚐𝚎.
2. 𝚘𝚗𝚕𝚢 𝚊𝚍𝚖𝚒𝚗𝚜 𝚌𝚊𝚗 𝚊𝚍𝚍 𝚏𝚒𝚕𝚝𝚎𝚛𝚜 𝚒𝚗 𝚊 𝚌𝚑𝚊𝚝.
3. 𝚊𝚕𝚎𝚛𝚝 𝚋𝚞𝚝𝚝𝚘𝚗𝚜 𝚑𝚊𝚟𝚎 𝚊 𝚕𝚒𝚖𝚒𝚝 𝚘𝚏 𝟼𝟺 𝚌𝚑𝚊𝚛𝚊𝚌𝚝𝚎𝚛𝚜.

<b>𝙲𝚘𝚖𝚖𝚊𝚗𝚍𝚜 𝚊𝚗𝚍 𝚄𝚜𝚊𝚐𝚎:</b>
• /filter - <code>𝚊𝚍𝚍 𝚊 𝚏𝚒𝚕𝚝𝚎𝚛 𝚒𝚗 𝚌𝚑𝚊𝚝</code>
• /filters - <code>𝚕𝚒𝚜𝚝 𝚊𝚕𝚕 𝚝𝚑𝚎 𝚏𝚒𝚕𝚝𝚎𝚛𝚜 𝚘𝚏 𝚊 𝚌𝚑𝚊𝚝</code>
• /del - <code>𝚍𝚎𝚕𝚎𝚝𝚎 𝚊 𝚜𝚙𝚎𝚌𝚒𝚏𝚒𝚌 𝚏𝚒𝚕𝚝𝚎𝚛 𝚒𝚗 𝚌𝚑𝚊𝚝</code>
• /delall - <code>𝚍𝚎𝚕𝚎𝚝𝚎 𝚝𝚑𝚎 𝚠𝚑𝚘𝚕𝚎 𝚏𝚒𝚕𝚝𝚎𝚛𝚜 𝚒𝚗 𝚊 𝚌𝚑𝚊𝚝 (𝚌𝚑𝚊𝚝 𝚘𝚠𝚗𝚎𝚛 𝚘𝚗𝚕𝚢)</code>"""
    BUTTON_TXT = """𝙷𝚎𝚕𝚙: <b>𝙱𝚞𝚝𝚝𝚘𝚗𝚜</b>

- 𝙴𝚟𝚊 𝙼𝚊𝚛𝚒𝚊 𝚂𝚞𝚙𝚙𝚘𝚛𝚝𝚜 𝚋𝚘𝚝𝚑 𝚞𝚛𝚕 𝚊𝚗𝚍 𝚊𝚕𝚎𝚛𝚝 𝚒𝚗𝚕𝚒𝚗𝚎 𝚋𝚞𝚝𝚝𝚘𝚗𝚜.

<b>𝙽𝙾𝚃𝙴:</b>
1. 𝚃𝚎𝚕𝚎𝚐𝚛𝚊𝚖 𝚠𝚒𝚕𝚕 𝚗𝚘𝚝 𝚊𝚕𝚕𝚘𝚠 𝚢𝚘𝚞 𝚝𝚘 𝚜𝚎𝚗𝚍 𝚋𝚞𝚝𝚝𝚘𝚗𝚜 𝚠𝚒𝚝𝚑𝚘𝚞𝚝 𝚊𝚗𝚢 𝚌𝚘𝚗𝚝𝚎𝚗𝚝, 𝚜𝚘 𝚌𝚘𝚗𝚝𝚎𝚗𝚝 𝚒𝚜 𝚖𝚊𝚗𝚍𝚊𝚝𝚘𝚛𝚢.
2. 𝚃𝚑𝚒𝚜 𝙱𝚘𝚝 𝚜𝚞𝚙𝚙𝚘𝚛𝚝𝚜 𝚋𝚞𝚝𝚝𝚘𝚗𝚜 𝚠𝚒𝚝𝚑 𝚊𝚗𝚢 𝚝𝚎𝚕𝚎𝚐𝚛𝚊𝚖 𝚖𝚎𝚍𝚒𝚊 𝚝𝚢𝚙𝚎.
3. 𝙱𝚞𝚝𝚝𝚘𝚗𝚜 𝚜𝚑𝚘𝚞𝚕𝚍 𝚋𝚎 𝚙𝚛𝚘𝚙𝚎𝚛𝚕𝚢 𝚙𝚊𝚛𝚜𝚎𝚍 𝚊𝚜 𝚖𝚊𝚛𝚔𝚍𝚘𝚠𝚗 𝚏𝚘𝚛𝚖𝚊𝚝.

<b>𝚄𝚁𝙻 𝚋𝚞𝚝𝚝𝚘𝚗𝚜:</b>
<code>[𝙱𝚞𝚝𝚝𝚘𝚗 𝚃𝚎𝚡𝚝](𝚋𝚞𝚝𝚝𝚘𝚗𝚞𝚛𝚕:https://t.me/xxxxxxxxx)</code>

<b>𝙰𝚕𝚎𝚛𝚝 𝚋𝚞𝚝𝚝𝚘𝚗𝚜:</b>
<code>[𝙱𝚞𝚝𝚝𝚘𝚗 𝚃𝚎𝚡𝚝](𝚋𝚞𝚝𝚝𝚘𝚗𝚊𝚕𝚎𝚛𝚝:𝚃𝚑𝚒𝚜 𝚒𝚜 𝚊𝚗 𝚊𝚕𝚎𝚛𝚝 𝚖𝚎𝚜𝚜𝚊𝚐𝚎)</code>"""
    AUTOFILTER_TXT = """𝙷𝚎𝚕𝚙: <b>𝙰𝚞𝚝𝚘 𝙵𝚒𝚕𝚝𝚎𝚛</b>

<b>𝙽𝙾𝚃𝙴:</b>
1. 𝙼𝚊𝚔𝚎 𝚖𝚎 𝚝𝚑𝚎 𝚊𝚍𝚖𝚒𝚗 𝚘𝚏 𝚢𝚘𝚞𝚛 𝚌𝚑𝚊𝚗𝚗𝚎𝚕 𝚒𝚏 𝚒𝚝'𝚜 𝚙𝚛𝚒𝚟𝚊𝚝𝚎.
2. 𝚖𝚊𝚔𝚎 𝚜𝚞𝚛𝚎 𝚝𝚑𝚊𝚝 𝚢𝚘𝚞𝚛 𝚌𝚑𝚊𝚗𝚗𝚎𝚕 𝚍𝚘𝚎𝚜 𝚗𝚘𝚝 𝚌𝚘𝚗𝚝𝚊𝚒𝚗 𝚌𝚊𝚖𝚛𝚒𝚙𝚜, 𝚙𝚘𝚛𝚗 𝚊𝚗𝚍 𝚏𝚊𝚔𝚎 𝚏𝚒𝚕𝚎𝚜.
3. 𝙵𝚘𝚛𝚠𝚊𝚛𝚍 𝚝𝚑𝚎 𝚕𝚊𝚜𝚝 𝚖𝚎𝚜𝚜𝚊𝚐𝚎 𝚝𝚘 𝚖𝚎 𝚠𝚒𝚝𝚑 𝚚𝚞𝚘𝚝𝚎𝚜.
 𝙸'𝚕𝚕 𝚊𝚍𝚍 𝚊𝚕𝚕 𝚝𝚑𝚎 𝚏𝚒𝚕𝚎𝚜 𝚒𝚗 𝚝𝚑𝚊𝚝 𝚌𝚑𝚊𝚗𝚗𝚎𝚕 𝚝𝚘 𝚖𝚢 𝚍𝚋."""
    CONNECTION_TXT = """𝙷𝚎𝚕𝚙: <b>𝙲𝚘𝚗𝚗𝚎𝚌𝚝𝚒𝚘𝚗𝚜</b>

- 𝚄𝚜𝚎𝚍 𝚝𝚘 𝚌𝚘𝚗𝚗𝚎𝚌𝚝 𝚋𝚘𝚝 𝚝𝚘 𝙿𝙼 𝚏𝚘𝚛 𝚖𝚊𝚗𝚊𝚐𝚒𝚗𝚐 𝚏𝚒𝚕𝚝𝚎𝚛𝚜 
- 𝚒𝚝 𝚑𝚎𝚕𝚙𝚜 𝚝𝚘 𝚊𝚟𝚘𝚒𝚍 𝚜𝚙𝚊𝚖𝚖𝚒𝚗𝚐 𝚒𝚗 𝚐𝚛𝚘𝚞𝚙𝚜.

<b>𝙽𝙾𝚃𝙴:</b>
1. 𝙾𝚗𝚕𝚢 𝚊𝚍𝚖𝚒𝚗𝚜 𝚌𝚊𝚗 𝚊𝚍𝚍 𝚊 𝚌𝚘𝚗𝚗𝚎𝚌𝚝𝚒𝚘𝚗.
2. 𝚂𝚎𝚗𝚍 <code>/𝚌𝚘𝚗𝚗𝚎𝚌𝚝</code> 𝚏𝚘𝚛 𝚌𝚘𝚗𝚗𝚎𝚌𝚝𝚒𝚗𝚐 𝚖𝚎 𝚝𝚘 𝚞𝚛 𝙿𝙼

<b>𝙲𝚘𝚖𝚖𝚊𝚗𝚍𝚜 𝚊𝚗𝚍 𝚄𝚜𝚊𝚐𝚎:</b>
• /connect  - <code>𝚌𝚘𝚗𝚗𝚎𝚌𝚝 𝚊 𝚙𝚊𝚛𝚝𝚒𝚌𝚞𝚕𝚊𝚛 𝚌𝚑𝚊𝚝 𝚝𝚘 𝚢𝚘𝚞𝚛 𝙿𝙼</code>
• /disconnect  - <code>𝚍𝚒𝚜𝚌𝚘𝚗𝚗𝚎𝚌𝚝 𝚏𝚛𝚘𝚖 𝚊 𝚌𝚑𝚊𝚝</code>
• /connections - <code>𝚕𝚒𝚜𝚝 𝚊𝚕𝚕 𝚢𝚘𝚞𝚛 𝚌𝚘𝚗𝚗𝚎𝚌𝚝𝚒𝚘𝚗𝚜</code>"""
    EXTRAMOD_TXT = """𝙷𝚎𝚕𝚙: <b>𝙴𝚡𝚝𝚛𝚊 𝙼𝚘𝚍𝚞𝚕𝚎𝚜</b>

<b>𝙽𝙾𝚃𝙴:</b>
𝚝𝚑𝚎𝚜𝚎 𝚊𝚛𝚎 𝚝𝚑𝚎 𝚎𝚡𝚝𝚛𝚊 𝚏𝚎𝚊𝚝𝚞𝚛𝚎𝚜 𝚘𝚏 𝙴𝚟𝚊 𝙼𝚊𝚛𝚒𝚊

<b>𝙲𝚘𝚖𝚖𝚊𝚗𝚍𝚜 𝚊𝚗𝚍 𝚄𝚜𝚊𝚐𝚎:</b>
• /id - <code>𝚐𝚎𝚝 𝚒𝚍 𝚘𝚏 𝚊 𝚜𝚙𝚎𝚌𝚒𝚏𝚒𝚎𝚍 𝚞𝚜𝚎𝚛.</code>
• /info  - <code>𝚐𝚎𝚝 𝚒𝚗𝚏𝚘𝚛𝚖𝚊𝚝𝚒𝚘𝚗 𝚊𝚋𝚘𝚞𝚝 𝚊 𝚞𝚜𝚎𝚛.</code>
• /imdb  - <code>𝚐𝚎𝚝 𝚝𝚑𝚎 𝚏𝚒𝚕𝚖 𝚒𝚗𝚏𝚘𝚛𝚖𝚊𝚝𝚒𝚘𝚗 𝚏𝚛𝚘𝚖 𝙸𝙼𝙳𝙱 𝚜𝚘𝚞𝚛𝚌𝚎.</code>
• /search  - <code>𝚐𝚎𝚝 𝚝𝚑𝚎 𝚏𝚒𝚕𝚖 𝚒𝚗𝚏𝚘𝚛𝚖𝚊𝚝𝚒𝚘𝚗 𝚏𝚛𝚘𝚖 𝚟𝚊𝚛𝚒𝚘𝚞𝚜 𝚜𝚘𝚞𝚛𝚌𝚎𝚜.</code>"""
    ADMIN_TXT = """𝙷𝚎𝚕𝚙: <b>𝙰𝚍𝚖𝚒𝚗 𝚖𝚘𝚍𝚜</b>

<b>𝙽𝙾𝚃𝙴:</b>
𝚃𝚑𝚒𝚜 𝚖𝚘𝚍𝚞𝚕𝚎 𝚘𝚗𝚕𝚢 𝚠𝚘𝚛𝚔𝚜 𝚏𝚘𝚛 𝚖𝚢 𝚊𝚍𝚖𝚒𝚗𝚜

<b>𝙲𝚘𝚖𝚖𝚊𝚗𝚍𝚜 𝚊𝚗𝚍 𝚄𝚜𝚊𝚐𝚎:</b>
• /logs - <code>𝚝𝚘 𝚐𝚎𝚝 𝚝𝚑𝚎 𝚛𝚎𝚜𝚌𝚎𝚗𝚝 𝚎𝚛𝚛𝚘𝚛𝚜</code>
• /stats - <code>𝚝𝚘 𝚐𝚎𝚝 𝚜𝚝𝚊𝚝𝚞𝚜 𝚘𝚏 𝚏𝚒𝚕𝚎𝚜 𝚒𝚗 𝚍𝚋.</code>
• /delete - <code>𝚝𝚘 𝚍𝚎𝚕𝚎𝚝𝚎 𝚊 𝚜𝚙𝚎𝚌𝚒𝚏𝚒𝚌 𝚏𝚒𝚕𝚎 𝚏𝚛𝚘𝚖 𝚍𝚋.</code>
• /users - <code>𝚝𝚘 𝚐𝚎𝚝 𝚕𝚒𝚜𝚝 𝚘𝚏 𝚖𝚢 𝚞𝚜𝚎𝚛𝚜 𝚊𝚗𝚍 𝚒𝚍𝚜.</code>
• /chats - <code>𝚝𝚘 𝚐𝚎𝚝 𝚕𝚒𝚜𝚝 𝚘𝚏 𝚖𝚢 𝚌𝚑𝚊𝚝𝚜 𝚊𝚗𝚍 𝚒𝚍𝚜 </code>
• /leave  - <code>𝚝𝚘 𝚕𝚎𝚊𝚟𝚎 𝚏𝚛𝚘𝚖 𝚊 𝚌𝚑𝚊𝚝.</code>
• /disable  -  <code>𝚍𝚘 𝚍𝚒𝚜𝚊𝚋𝚕𝚎 𝚊 𝚌𝚑𝚊𝚝.</code>
• /ban  - <code>𝚝𝚘 𝚋𝚊𝚗 𝚊 𝚞𝚜𝚎𝚛.</code>
• /unban  - <code>𝚝𝚘 𝚞𝚗𝚋𝚊𝚗 𝚊 𝚞𝚜𝚎𝚛.</code>
• /channel - <code>𝚝𝚘 𝚐𝚎𝚝 𝚕𝚒𝚜𝚝 𝚘𝚏 𝚝𝚘𝚝𝚊𝚕 𝚌𝚘𝚗𝚗𝚎𝚔𝚝𝚎𝚍 𝚌𝚑𝚊𝚗𝚗𝚎𝚕𝚜</code>
• /broadcast - <code>𝚝𝚘 𝚋𝚛𝚘𝚊𝚍𝚌𝚊𝚜𝚝 𝚊 𝚖𝚎𝚜𝚜𝚊𝚐𝚎 𝚝𝚘 𝚊𝚕𝚕 𝚞𝚜𝚎𝚛𝚜</code>"""
    STATUS_TXT = """★ 𝚃𝙾𝚃𝙰𝙻 𝙵𝙸𝙻𝙴𝚂: <code>{}</code>
★ 𝚃𝙾𝚃𝙰𝙻 𝚄𝚂𝙴𝚁𝚂: <code>{}</code>
★ 𝚃𝙾𝚃𝙰𝙻 𝙲𝙷𝙰𝚃𝚂: <code>{}</code>
★ 𝚄𝚂𝙴𝙳 𝚂𝚃𝙾𝚁𝙰𝙶𝙴: <code>{}</code> 𝙼𝚒𝚋
★ 𝙵𝚁𝙴𝙴 𝚂𝚃𝙾𝚁𝙰𝙶𝙴: <code>{}</code> 𝙼𝚒𝚋"""
    LOG_TEXT_G = """#𝙽𝚎𝚠𝙶𝚛𝚘𝚞𝚙
𝙶𝚛𝚘𝚞𝚙 = {}(<code>{}</code>)
𝚃𝚘𝚝𝚊𝚕 𝙼𝚎𝚖𝚋𝚎𝚛𝚜 = <code>{}</code>
𝙰𝚍𝚍𝚎𝚍 𝙱𝚢 - {}
"""
    LOG_TEXT_P = """#𝙽𝚎𝚠𝚄𝚜𝚎𝚛
𝙸𝙳 - <code>{}</code>
𝙽𝚊𝚖𝚎 - {}
"""
